{
  "language": "Language",
  "name": "Márton Nagy",
  "jobTitle": "Front-End Developer",
  "phoneNumber": "+36 30 214 8681",
  "email": "martonnagywork@gmail.com",
  "spokenLanguagesText": "Spoken languages: English, Hungarian",
  "about": "About",
  "technicalSkills": "Technical skills",
  "professionalExperience": "Professional experience",
  "angularLabel": "Angular(v18)",
  "materialLabel": "Angular Material",
  "reactLabel": "React",
  "tsLabel": "TypeScript",
  "cssLabel": "CSS (SCSS)",
  "deployLabel": "Octopus, Azure DevOps",
  "dotnetLabel": ".NET Core",
  "tsqlLabel": "TSQL",
  "angularDescription": "Experienced in building and maintaining dynamic, feature-rich web applications using Angular. Proficient in key concepts like routing, reactive forms, RxJS (observables, operators), signals, modules, standalone components, and dependency injection. Successfully updated projects to leverage the latest Angular features, including migrating to a zoneless architecture. Strong focus on staying current with Angular updates, best practices, and trends to ensure optimized performance and maintainability across projects.",
  "materialDescription": "Extensive experience using Angular Material to build modern, responsive user interfaces. Proficient in leveraging Angular Material components, theming, and custom styling to create consistent and intuitive designs across web applications. Familiar with form controls, navigation elements, and various UI components to enhance user experience",
  "reactDescription": "Familiar with functional React concepts, including Redux, routing, and hooks. Although my hands-on experience is limited, I have actively engaged in bug fixing and code optimization, gaining a solid understanding of core principles. Eager to deepen my knowledge and skills in React to contribute effectively to future projects.",
  "tsDescription": "Extensive experience using TypeScript to enhance code quality and maintainability in large-scale applications. Proficient in static typing, interfaces, and advanced features such as generics and decorators. Well-versed in integrating TypeScript with frameworks like Angular to create robust, scalable solutions. Committed to following best practices and continuously improving my skills to leverage TypeScript’s full potential in diverse projects.",
  "cssDescription": "",
  "deployDescription": "",
  "dotnetDescription": "",
  "tsqlDescription": "",
  "introductionFirstParagraph": "I am a Frontend Developer with over 3 years of experience, primarily focused on building responsive and user-friendly web applications. I began my career working with Angular and have since expanded my skills to include React. Additionally, I have experience in backend technologies and database management, enabling me to support backend tasks when needed. Throughout my career, I have taken part in developing new features and refactoring code to ensure it adheres to the latest standards, including making the application \"zoneless\" by using angular signals.",
  "introductionSecondParagraph": "I hold a Bachelor's degree in Chemistry from Eötvös Loránd University, and I initially started as a chemist. During my time working at a pharmaceutical company, I developed a strong interest in coding, leading me to pursue a career change. After one year, I enrolled in the Software Engineering program at Óbudai University. I joined ASD during my studies, a company that connects software engineers with various projects. While I have worked on several projects, my primary focus has been on a large-scale educational platform used by institutions across Hungary, including kindergartens, primary and secondary schools, and adult education centers. This platform serves over a million users, and I have been involved in its continuous development, optimization, and modernization, helping to refactor the codebase and bring it up to the latest standards."
}
