{
  "language": "Nyelv",
  "name": "Nagy Márton",
  "jobTitle": "Front-End fejlesztő",
  "phoneNumber": "+36 30 214 8681",
  "email": "martonnagywork@gmail.com",
  "spokenLanguagesText": "Beszélt nyelvek: Magyar, Angol",
  "about": "Elérhetőség",
  "technicalSkills": "Szakmai készségek",
  "professionalExperience": "Szakmai tapasztalat",
  "angularLabel": "Angular(v18)",
  "materialLabel": "Angular Material",
  "reactLabel": "React",
  "tsLabel": "TypeScript",
  "cssLabel": "CSS (SCSS)",
  "deployLabel": "Octopus, Azure DevOps",
  "dotnetLabel": ".NET Core",
  "tsqlLabel": "TSQL",
  "angularDescription": "Több, modern és interaktív webalkalmazás fejlesztésében vettem részt Angular keretrendszerrel. Jártas vagyok a routing, reaktív űrlapok, RxJS (observables, operátorok), signalek, modulok, önálló komponensek és függőséginjektálás terén. Sikeresen frissítettem projekteket a legújabb Angular funkciókkal, többek között egy zoneless architektúrára való átállással. Folyamatosan követem az Angular újításait és legjobb gyakorlatait, hogy biztosítsam a projektek teljesítményének optimalizálását és hosszú távú fenntarthatóságát.",
  "materialDescription": "Széleskörű tapasztalattal rendelkezem az Angular Material használatában, modern, reszponzív felhasználói felületek kialakításához. Jártas vagyok az Angular Material komponensek, témák és egyedi stílusok alkalmazásában, hogy egységes és intuitív dizájnokat hozzak létre a webalkalmazásokban. Ismerem az űrlapvezérlőket, navigációs elemeket és különböző UI komponenseket, melyekkel javítom a felhasználói élményt.",
  "reactDescription": "Ismerem a funkcionális React alapelveit, beleértve a Redux-ot, a routingot és a hookokat. Bár a gyakorlati tapasztalatom korlátozott, aktívan részt vettem hibajavításokban és kódoptimalizálásban, ezzel megszerezve a legfontosabb fogalmakat. Vágyom arra, hogy tovább mélyítsem tudásomat és képességeimet a React terén, hogy hatékonyan hozzájárulhassak a jövőbeli projektekhez.",
  "tsDescription": "Széleskörű tapasztalatom van a TypeScript használatában, amely segíti a kód minőségének és karbantarthatóságának javítását nagyszabású alkalmazásokban. Jártas vagyok a statikus típusellenőrzés, interfészek, valamint fejlett funkciók, mint a generikusok és dekorátorok alkalmazásában. Jól ismerem a TypeScript integrálását olyan keretrendszerekkel, mint az Angular, hogy robusztus és skálázható megoldásokat hozzak létre. Elkötelezett vagyok a legjobb gyakorlatok követése mellett és folyamatosan fejlesztem tudásomat, hogy a TypeScript teljes potenciálját kihasználhassam különböző projektekben.",
  "cssDescription": "",
  "deployDescription": "",
  "dotnetDescription": "",
  "tsqlDescription": "",
  "introductionFirstParagraph": "Több mint 3 éves frontend fejlesztői tapasztalattal rendelkezem, főként reszponzív és felhasználóbarát webalkalmazások készítésére specializálódva. Pályafutásomat Angular fejlesztőként kezdtem, majd bővítettem tudásomat React irányába. Emellett backend technológiák és adatbázis-kezelés terén is szerzett tapasztalatokkal rendelkezem, így szükség esetén támogatni tudom a backend feladatokat is. Pályám során új funkciók fejlesztésében, valamint a kód refaktorálásában is részt vettem, hogy az alkalmazás megfeleljen a legfrissebb iparági szabványoknak. A fejlesztés során zoneless megközelítést alkalmaztunk, jelek (signals) használatával korszerűsítettük a kódot.",
  "introductionSecondParagraph": "Alapszakos diplomámat az Eötvös Loránd Tudományegyetemen szereztem kémiából, és eleinte vegyészként dolgoztam. A programozás iránti érdeklődésem egy gyógyszeripari cégnél végzett munka során alakult ki, ami végül pályaváltáshoz vezetett. Egy év után beiratkoztam az Óbudai Egyetem mérnökinformatikus képzésére, ahol tanulmányaim alatt csatlakoztam az ASD-hez. Ez a cég szoftvermérnököket közvetít különböző projektekhez. Több projektben is részt vettem, de leginkább egy nagyszabású oktatási platform fejlesztésére fókuszáltam, amelyet Magyarországon óvodák, általános és középiskolák, valamint felnőttképzési intézmények használnak. Ez a platform több mint egymillió felhasználót szolgál ki, és aktívan hozzájárultam a fejlesztéséhez, optimalizálásához, valamint a kódbázis korszerűsítéséhez, hogy az megfeleljen a legfrissebb technológiai elvárásoknak."
}
